
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 10 to change, 6 to destroy.</code></pre>

* Create
  * module.postgresql_staging[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_staging[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_staging[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;blob_router&#34;]
  * module.postgresql_staging[0].azurerm_resource_group.rg[0]
  * module.postgresql_staging[0].null_resource.set-user-permissions-additionaldbs[&#34;blob_router&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
* Delete
  * module.postgresql-staging.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql-staging.azurerm_postgresql_flexible_server_database.pg_databases[&#34;blob_router&#34;]
  * module.postgresql-staging.azurerm_resource_group.rg[0]
  * module.postgresql-staging.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-12T12:06:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-DATABASE/1e877432a45644dc957e4315c2fabc59"
        name                    = "blob-router-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-12T12:06:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-HOST/6aa828f356264ec7b7edac57e53f7819"
        name                    = "blob-router-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-12T12:06:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PASS/7f3ae7fe77f54babb83858b88c3f123c"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-12T12:06:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PORT/258b796368ff4a5bae718e543eae24fa"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-12T12:06:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-USER/9a55d421809b4beca1bdcd742c21f873"
        name                    = "blob-router-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-09T14:11:21Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-host/51af603b98ee42aca7cf2631adc3bbe0"
        name                    = "blob-router-staging-flexible-db-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-09T14:11:21Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-name/1b3b5c5e0c554eb89a60aef83a27c8cb"
        name                    = "blob-router-staging-flexible-db-name"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-09T14:11:21Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-password/827ec805cf1e4303a6deccdc32552315"
        name                    = "blob-router-staging-flexible-db-password"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-09T14:11:21Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-port/3f6911f2652641e28c00c0f7617e8352"
        name                    = "blob-router-staging-flexible-db-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-09T14:11:21Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-user/dceb88eefa2e4175b5479e9433a0a42c"
        name                    = "blob-router-staging-flexible-db-user"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server.pgsql_server will be destroyed
  # (because azurerm_postgresql_flexible_server.pgsql_server is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "blob_router" -> null
      - administrator_password        = (sensitive value) -> null
      - auto_grow_enabled             = false -> null
      - backup_retention_days         = 35 -> null
      - create_mode                   = "Default" -> null
      - delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" -> null
      - fqdn                          = "blob-router-flexible-postgres-db-v15-staging-aat.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/blob-router-flexible-postgres-db-v15-staging-aat" -> null
      - location                      = "uksouth" -> null
      - name                          = "blob-router-flexible-postgres-db-v15-staging-aat" -> null
      - private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> null
      - public_network_access_enabled = false -> null
      - resource_group_name           = "blob-router-flexible-postgres-db-v15-staging-data-aat" -> null
      - sku_name                      = "GP_Standard_D2s_v3" -> null
      - storage_mb                    = 65536 -> null
      - tags                          = {
          - "application"         = "bulk-scan-print"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "staging"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
      - version                       = "15" -> null
      - zone                          = "3" -> null

      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - high_availability {
          - mode                      = "ZoneRedundant" -> null
          - standby_availability_zone = "1" -> null
        }

      - maintenance_window {
          - day_of_week  = 0 -> null
          - start_hour   = 3 -> null
          - start_minute = 0 -> null
        }
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/blob-router-flexible-postgres-db-v15-staging-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_name      = "DTS Platform Operations" -> null
      - principal_type      = "Group" -> null
      - resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat" -> null
      - server_name         = "blob-router-flexible-postgres-db-v15-staging-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/blob-router-flexible-postgres-db-v15-staging-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - principal_name      = "jenkins-cftptl-intsvc-mi" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat" -> null
      - server_name         = "blob-router-flexible-postgres-db-v15-staging-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_database.pg_databases["blob_router"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.pg_databases is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/blob-router-flexible-postgres-db-v15-staging-aat/databases/blob_router" -> null
      - name      = "blob_router" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/blob-router-flexible-postgres-db-v15-staging-aat" -> null
    }

  # module.postgresql-staging.azurerm_resource_group.rg[0] will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-flexible-postgres-db-v15-staging-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "blob-router-flexible-postgres-db-v15-staging-data-aat" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "staging"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.postgresql-staging.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.postgresql_staging[0].azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "blob_router"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "blob-router-flexible-postgres-db-v15-staging-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_staging[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_staging[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_staging[0].azurerm_postgresql_flexible_server_database.pg_databases["blob_router"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "blob_router"
      + server_id = (known after apply)
    }

  # module.postgresql_staging[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + tags     = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
    }

  # module.postgresql_staging[0].null_resource.set-user-permissions-additionaldbs["blob_router"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "blob-router-flexible-postgres-db-v15-staging"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 7 to add, 10 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2133,"Program":"tfcmt","SHA1":"","Vars":{}} -->